//// Средний уровень сложности:
// Напишите цикл, который выводит в консоль все простые числа от 2 до 100.
//35 мин:

// Напишите цикл, который находит среднее арифметическое всех чисел в массиве.
//const numbers = [1, 2, 3, 4, 5];


// Напишите цикл, который выводит в консоль таблицу умножения на 5.


// Напишите цикл, который переворачивает порядок элементов в массиве.
//const array = ['hello', 5, 'hi', 65, false];

// Напишите цикл, который находит сумму элементов массива, кратных 3 или 5.

//Напиши подробный алгоритм задачи
