// 1. Напишите цикл, который считает сумму чисел от 20 до 35


// 2. Напишите цикл, который выводит произведение всех чисел от 10 до 15


//=========
// 3. Дан массив чисел. Сформировать новый массив, в который войдут только положительные числа



// numbers - массив с числами
// i - индекс элемента массива (0-8)
// numbers[i] - элемент массива по индексу

//=========

// 4. Сформировать новый массив из четных чисел
// const numbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10];




// 5. Сформировать новый массив из четных отрицательных чисел => [-88]
// const numbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10];

//=========

// 6. Сформировать новый массив из чисел, заканчивющихся на 5 => [5, 15, 35, -5]
// const numbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10];



// || ИЛИ
// && И

// 73 % 10 === 3
// 58 % 10 === 8
// 35 % 10 === 5


// 7. Сформировать новый массив, состоящий их последних цифр чисел => [1, 5, -7, -8, 9, 4, 5, 5, -5, 0]




// 8. Сформировать новый массив, состоящий из последних цифр чисел (без -) => [1, 5, 7, 8, 9, 4, 5, 5, 5, 0]
// const numbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10];
